Repository: pingfangx/BlogX
Catalog: CodeFarmer/python/usage/2393/project_save.tmx
Source language: en_us
Languages: zh_cn

source: (For example, the return value might be - signal.SIGKILL if the subprocess was killed.) On Windows systems, the return value contains the signed integer return code from the child process.
zh_cn: (例如，如果子进程被终止，返回值可能是 - signal.SIGKILL。)在 Windows 系统上，返回值包含来自子进程的有符号整数返回码。

source: (Note that the subprocess module provides more powerful facilities for spawning new processes and retrieving their results; using that module is preferable to using these functions.
zh_cn: （请注意， subprocess 模块为产生新进程和检索结果提供了更强大的功能;使用该模块优于使用这些功能。

source: (POSIX only)
zh_cn: (仅限 POSIX)

source: (Windows only)
zh_cn: (仅限 Windows)

source: (except that the input and check parameters are not supported)
zh_cn: (不支持 input 和 check 参数)

source: (except that the input parameter is not supported)
zh_cn: (除了不支持 input 参数)

source: shlex.split() can be useful when determining the correct tokenization for args, especially in complex cases:
zh_cn: 在确定 args 的正确标记时，尤其是在复杂情况下，shlex.split() 是有用的:

source: PIPE indicates that a new pipe to the child should be created.
zh_cn: PIPE 表示应该创建一个新的管道。

source: DEVNULL indicates that the special file os.devnull will be used.
zh_cn: DEVNULL 表示特殊文件 os.devnull 将被使用。

source: 0 means unbuffered (read and write are one system call and can return short)
zh_cn: 0 表示无缓冲(读取和写入是一个系统调用，可以返回短)

source: 1 means line buffered (only usable if universal_newlines=True i.e., in a text mode)
zh_cn: 1 表示缓冲行(只有在 universal_newlines=True 时才可用，即在文本模式下)

source: args should be a sequence of program arguments or else a single string.
zh_cn: args 应该是一个程序参数序列或者单个字符串。

source: bufsize will be supplied as the corresponding argument to the open() function when creating the stdin/stdout/stderr pipe file objects:
zh_cn: 当创建 stdin / stdout / stderr 管道文件对象时，bufsize 将作为相应的参数提供给 open() 函数：

source: pass_fds is an optional sequence of file descriptors to keep open between the parent and child.
zh_cn: pass_fds 是一个可选的文件描述符序列，用于在父代和子代之间保持开放。

source: stdin, stdout and stderr specify the executed program’s standard input, standard output and standard error file handles, respectively.
zh_cn: stdin，stdout 和 stderr 分别指定执行程序的标准输入，标准输出和标准错误文件句柄。

source: cwd can be a str and path-like object.
zh_cn: cwd 可以是 str 和 path-like 对象。

source: creationflags, if given, can be CREATE_NEW_CONSOLE or CREATE_NEW_PROCESS_GROUP.
zh_cn: creationflags 可以是 CREATE_NEW_CONSOLE 或 CREATE_NEW_PROCESS_GROUP。

source: Changed in version 3.2: restore_signals was added.
zh_cn: Changed in version 3.2: restore_signals 已添加。

source: Changed in version 3.2: start_new_session was added.
zh_cn: Changed in version 3.2: start_new_session 已添加。

source: Changed in version 3.2: Added context manager support.
zh_cn: Changed in version 3.2: 添加了上下文管理器支持。

source: Changed in version 3.2: The default for close_fds was changed from False to what is described above.
zh_cn: Changed in version 3.2: close_fds 的默认值已从 False 更改为如上所述。

source: Changed in version 3.3.1: bufsize now defaults to -1 to enable buffering by default to match the behavior that most code expects.
zh_cn: Changed in version 3.3.1: bufsize 现在默认为-1，以默认启用缓冲以匹配大多数代码所期望的行为。

source: Changed in version 3.6: cwd parameter accepts a path-like object.
zh_cn: Changed in version 3.6: cwd 参数接受 path-like object。

source: Changed in version 3.6: Popen destructor now emits a ResourceWarning warning if the child process is still running.
zh_cn: Changed in version 3.6: 如果子进程仍在运行，Popen 析构函数现在会发出 ResourceWarning 警告。

source: New in version 3.2: The pass_fds parameter was added.
zh_cn: New in version 3.2: 添加了 pass_fds 参数。

source: New in version 3.6: encoding and errors were added.
zh_cn: New in version 3.6: encoding 和 errors。

source: Additionally, stderr can be STDOUT, which indicates that the stderr data from the applications should be captured into the same file handle as for stdout.
zh_cn: 此外，stderr 可以是 STDOUT，这表明来自应用程序的 stderr 数据应该被捕获到相同的文件句柄为 stdout。

source: Attributes of that exception hold the arguments, the exit code, and stdout and stderr if they were captured.
zh_cn: 该异常的属性包含参数，退出代码以及 stdout 和 stderr（如果它们被捕获）。

source: By default, the program to execute is the first item in args if args is a sequence.
zh_cn: 默认情况下，如果 args 是一个序列，则要执行的程序是 args 中的第一个项目。

source: By default, this function will return the data as encoded bytes.
zh_cn: 默认情况下，此函数将以编码字节的形式返回数据。

source: Changes to sys.stdin, etc. are not reflected in the environment of the executed command.
zh_cn: 执行的命令的环境中不会反映 sys.stdin 等的变化。

source: Check especially the Replacing Older Functions with the subprocess Module section.)
zh_cn: 特别检查 Replacing Older Functions with the subprocess Module 部分。）

source: Currently this includes the SIGPIPE, SIGXFZ and SIGXFSZ signals.
zh_cn: 目前这包括 SIGPIPE，SIGXFZ 和 SIGXFSZ 信号。

source: Do not use stdout=PIPE or stderr=PIPE with this function.
zh_cn: 使用此功能不要使用 stdout=PIPE 或 stderr=PIPE。

source: Examples:
zh_cn: 例子：

source: Execute a child program in a new process.
zh_cn: 在新进程中执行子程序。

source: Execute the command (a string) in a subshell.
zh_cn: 在子 shell 中执行命令(一个字符串)。

source: Execute the program path in a new process.
zh_cn: 在新进程中执行程序 path。

source: For more advanced use cases, the underlying Popen interface can be used directly.
zh_cn: 对于更高级的用例，可以直接使用底层的 Popen 接口。

source: However, explicitly passing input=None to inherit the parent’s standard input file handle is not supported.
zh_cn: 但是，不支持显式传递 input=None 来继承父级的标准输入文件句柄。

source: However, the original args is still passed to the program.
zh_cn: 但是，原始的 args 仍然传递给程序。

source: However, this can only be done if not passing arguments to the program.
zh_cn: 但是，只有在不向程序传递参数的情况下才能完成此操作。

source: If shell=True, on POSIX the executable argument specifies a replacement shell for the default /bin/sh.
zh_cn: 如果 shell=True，则在 POSIX 上，executable 参数为默认的 /bin/sh。

source: If check is true, and the process exits with a non-zero exit code, a CalledProcessError exception will be raised.
zh_cn: 如果 check 为 true，并且该进程以非零退出代码退出，则 CalledProcessError 异常将为抛出。

source: If close_fds is true, all file descriptors except 0, 1 and 2 will be closed before the child process is executed.
zh_cn: 如果 close_fds 为 true，则除 0，1 和 2 外的所有文件描述符将在执行子进程之前关闭。

source: If cwd is not None, the function changes the working directory to cwd before executing the child.
zh_cn: 如果 cwd 不是 None，那么在执行该子项之前，该函数会将工作目录更改为 cwd。

source: If encoding or errors are specified, or universal_newlines is true, file objects for stdin, stdout and stderr are opened in text mode using the specified encoding and errors or the io.TextIOWrapper default.
zh_cn: 如果指定了 encoding 或 errors，或者 universal_newlines 为 true，则 stdin，stdout 和 stderr 的文件对象将在文本模式下使用指定的 encoding 和 errors 或 io.TextIOWrapper 默认。

source: If encoding or errors are specified, the file objects stdin, stdout and stderr are opened in text mode with the specified encoding and errors, as described above in Frequently Used Arguments.
zh_cn: 如果指定了 encoding 或 errors，则文件对象 stdin，stdout 和 stderr 在文本模式下使用指定的编码和 errors 打开，如上面 Frequently Used Arguments 中所述。

source: If env is not None, it must be a mapping that defines the environment variables for the new process; these are used instead of the default behavior of inheriting the current process’ environment.
zh_cn: 如果 env 不是 None，它必须是一个映射，为新进程定义环境变量;这些被用来代替继承当前进程环境的默认行为。

source: If mode is P_NOWAIT, this function returns the process id of the new process; if mode is P_WAIT, returns the process’s exit code if it exits normally, or -signal, where signal is the signal that killed the process.
zh_cn: 如果 mode 是 P_NOWAIT，该函数返回新进程的进程 ID;如果 mode 是 P_WAIT，则返回进程退出代码（如果正常退出）或 -signal，其中 signal 是杀死进程的信号。

source: If preexec_fn is set to a callable object, this object will be called in the child process just before the child is executed.
zh_cn: 如果将 preexec_fn 设置为可调用对象，则将在子进程执行之前在子进程中调用此对象。

source: If restore_signals is true (the default) all signals that Python has set to SIG_IGN are restored to SIG_DFL in the child process before the exec.
zh_cn: 如果 restore_signals 为 true(缺省值)，则 Python 设置为 SIG_IGN 的所有信号都会在执行 exec 之前的子进程中恢复为 SIG_DFL。

source: If start_new_session is true the setsid() system call will be made in the child process prior to the execution of the subprocess.
zh_cn: 如果 start_new_session 为 true，则将在执行子进程之前在子进程中进行 setsid() 系统调用。

source: If args is a string, the interpretation is platform-dependent and described below.
zh_cn: 如果 args 是一个字符串，则解释依赖于平台，并在下面进行描述。

source: If shell is True, it is recommended to pass args as a string rather than as a sequence.
zh_cn: 如果 shell 为 True，建议将 args 作为字符串而不是序列传递。

source: If args is a string, the string specifies the command to execute through the shell.
zh_cn: 如果 args 是一个字符串，则该字符串指定要通过 shell 执行的命令。

source: If args is a sequence, the first item specifies the command string, and any additional items will be treated as additional arguments to the shell itself.
zh_cn: 如果 args 是一个序列，则第一个项目指定命令字符串，任何其他项目将被视为 shell 本身的附加参数。

source: If command generates any output, it will be sent to the interpreter standard output stream.
zh_cn: 如果 command 产生任何输出，它将被发送到解释器标准输出流。

source: If universal_newlines is True, they are opened in text mode with default encoding.
zh_cn: 如果 universal_newlines 为 True，则它们以默认编码的文本模式打开。

source: If given, startupinfo will be a STARTUPINFO object, which is passed to the underlying CreateProcess function.
zh_cn: 如果给出，<startup> <startup> 将是 STARTUPINFO 对象，该对象被传递给底层的 CreateProcess 函数。

source: If specified, env must provide any variables required for the program to execute.
zh_cn: 如果指定，env 必须提供程序执行所需的任何变量。

source: If the return code is negative, the process was terminated by the signal given by the negated value of the return code.
zh_cn: 如果返回码是负数，则处理过程由返回码的取反值给出的信号终止。

source: If the return code was non-zero it raises a CalledProcessError.
zh_cn: 如果返回码不为零，则会引发 CalledProcessError。

source: If the return code was zero then return, otherwise raise CalledProcessError.
zh_cn: 如果返回码为零，则返回，否则引发 CalledProcessError。

source: If the timeout expires, the child process will be killed and waited for.
zh_cn: 如果超时过期，子进程将被终止并等待。

source: If used it must be a byte sequence, or a string if encoding or errors is specified or universal_newlines is true.
zh_cn: 如果使用它，则必须是字节序列，或者如果指定了 encoding 或 errors 或 universal_newlines 为真，则为字符串。

source: If you must use it, keep it trivial!
zh_cn: 如果你必须使用它，保持它微不足道！

source: If you need to modify the environment for the child use the env parameter rather than doing it in a preexec_fn.
zh_cn: 如果您需要为孩子修改环境，请使用 env 参数，而不是在 preexec_fn 中执行。

source: In either case, the arguments to the child process must start with the name of the command being run.
zh_cn: 无论哪种情况，子进程的参数都必须以正在运行的命令的名称开始。

source: In particular, the function looks for executable (or for the first item in args) relative to cwd if the executable path is a relative path.
zh_cn: 特别是，如果可执行路径是相对路径，该函数会查找 executable(或 args 中的第一项)相对于 cwd。

source: In versions prior to Python 3.2.4 and 3.3.1 it incorrectly defaulted to 0 which was unbuffered and allowed short reads.
zh_cn: 在 Python 3.2.4 和 3.3.1 之前的版本中，它错误地默认为 0，这是未缓冲的并允许短读取。

source: It is very seldom needed.
zh_cn: 这是很少需要的。

source: It offers a lot of flexibility so that developers are able to handle the less common cases not covered by the convenience functions.
zh_cn: 它提供了很大的灵活性，以便开发人员能够处理不属于便利功能范围的不常见情况。

source: Minimize the number of libraries you call into.
zh_cn: 最大限度地减少您调用的库的数量。

source: Most programs treat the program specified by args as the command name, which can then be different from the program actually executed.
zh_cn: 大多数程序将由 args 指定的程序视为命令名，这可能与实际执行的程序不同。

source: Note
zh_cn: 注意

source: Note in particular that options (such as -input) and arguments (such as eggs.txt) that are separated by whitespace in the shell go in separate list elements, while arguments that need quoting or backslash escaping when used in the shell (such as filenames containing spaces or the echo command shown above) are single list elements.
zh_cn: 请特别注意，shell 中由空白分隔的选项(例如 -input)和参数(例如 eggs.txt)将放在单独的列表元素中，而参数在 shell 中使用时需要引用或反斜杠转义(例如包含空格的文件名或上面显示的 echo 命令)是单列表元素。

source: Note that POSIX does not specify the meaning of the return value of the C system() function, so the return value of the Python function is system-dependent.
zh_cn: 请注意，POSIX 并未指定 C system() 函数的返回值的含义，因此 Python 函数的返回值是与系统相关的。

source: Note that on Windows, you cannot set close_fds to true and also redirect the standard handles by setting stdin, stdout or stderr.
zh_cn: 请注意，在 Windows 上，您无法将 close_fds 设置为 true，并通过设置 stdin，stdout 或 stderr 来重定向标准句柄。

source: On POSIX systems, if the return code is positive it represents the return value of the process left-shifted by one byte.
zh_cn: 在 POSIX 系统上，如果返回码是正值，它表示进程的返回值左移一个字节。

source: On POSIX with shell=True, the shell defaults to /bin/sh.
zh_cn: 在使用 shell=True 的 POSIX 上，shell 默认为 /bin/sh。

source: On POSIX, if args is a string, the string is interpreted as the name or path of the program to execute.
zh_cn: 在 POSIX 上，如果 args 是一个字符串，则将该字符串解释为要执行的程序的名称或路径。

source: On POSIX, the args name becomes the display name for the executable in utilities such as ps.
zh_cn: 在 POSIX 上，args 名称成为 ps 等实用程序中可执行文件的显示名称。

source: On POSIX, the class uses os.execvp()-like behavior to execute the child program.
zh_cn: 在 POSIX 上，类使用 os.execvp()-类似行为来执行子程序。

source: On Unix, the return value is the exit status of the process encoded in the format specified for wait().
zh_cn: 在 Unix 上，返回值是以 wait() 格式编码的进程的退出状态。

source: On Windows it is true when stdin/stdout/stderr are None, false otherwise.
zh_cn: 在 Windows 上，如果 stdin / stdout / stderr 为 None 则返回 true，否则返回 false。

source: On Windows with shell=True, the COMSPEC environment variable specifies the default shell.
zh_cn: 在具有 shell=True 的 Windows 上， COMSPEC 环境变量指定了默认 shell。

source: On Windows, if args is a sequence, it will be converted to a string in a manner described in Converting an argument sequence to a string on Windows.
zh_cn: 在 Windows 上，如果 args 是一个序列，它将按照 Converting an argument sequence to a string on Windows 中描述的方式转换为字符串。

source: On Windows, if close_fds is true then no handles will be inherited by the child process.
zh_cn: 在 Windows 上，如果 close_fds 为 true，那么子进程将不会继承任何句柄。

source: On Windows, in order to run a side-by-side assembly the specified env must include a valid SystemRoot.
zh_cn: 在 Windows 上，为了运行 side-by-side assembly，指定的 env must 包含有效的 SystemRoot。

source: On Windows, the class uses the Windows CreateProcess() function.
zh_cn: 在 Windows 上，该类使用 Windows CreateProcess() 函数。

source: On Windows, the process id will actually be the process handle, so can be used with the waitpid() function.
zh_cn: 在 Windows 上，进程 ID 实际上是进程句柄，所以可以与 waitpid() 函数一起使用。

source: On Windows, the return value is that returned by the system shell after running command.
zh_cn: 在 Windows 上，返回值是运行 command 后由系统 shell 返回的值。

source: Open a pipe to or from command cmd.
zh_cn: 打开管道到命令 cmd ，或从命令 cmd 打开管道。

source: Otherwise, file objects are opened in binary mode.
zh_cn: 否则，文件对象以二进制模式打开。

source: Otherwise, they are opened as binary streams.
zh_cn: 否则，它们会以二进制流的形式打开。

source: Popen objects are supported as context managers via the with statement: on exit, standard file descriptors are closed, and the process is waited for.
zh_cn: Popen 通过 with 语句支持上下文管理器：退出时，关闭标准文件描述符，并等待进程。

source: Prior to Python 3.5, these three functions comprised the high level API to subprocess.
zh_cn: 在 Python 3.5 之前，这三个函数将高级 API 组成了子进程。

source: Providing any pass_fds forces close_fds to be True.
zh_cn: 提供 pass_fds 强制 close_fds 为 True。

source: Read the Security Considerations section before using shell=True.
zh_cn: 在使用 shell=True 之前，阅读 Security Considerations 部分。

source: Run command with arguments and return its output.
zh_cn: 用参数运行命令并返回其输出。

source: Run command with arguments.
zh_cn: 带参数运行命令。

source: Run the command described by args.
zh_cn: 运行 args 中描述的命令。

source: See the Replacing Older Functions with the subprocess Module section in the subprocess documentation for some helpful recipes.
zh_cn: 请参阅 subprocess 文档中的 Replacing Older Functions with the subprocess Module 查看有用的帮助。

source: See the shell and executable arguments for additional differences from the default behavior.
zh_cn: 请参阅 shell 和 executable 参数，以获取与默认行为的其他差异。

source: That is to say, Popen does the equivalent of:
zh_cn: 也就是说，Popen 等价于：

source: The run() function was added in Python 3.5; if you need to retain compatibility with older versions, see the Older high-level API section.
zh_cn: 在 Python 3.5 中添加了run() 函数;如果您需要保留与旧版本的兼容性，请参阅 Older high-level API 部分。

source: The subprocess module provides more powerful facilities for spawning new processes and retrieving their results; using that module is preferable to using this function.
zh_cn: subprocess 模块为产生新进程和检索结果提供了更强大的功能。使用该模块优于使用此功能。

source: The CalledProcessError object will have the return code in the returncode attribute and any output in the output attribute.
zh_cn: CalledProcessError 对象在 returncode 属性中包含返回代码，在 output 属性中的包含任何输出。

source: The CalledProcessError object will have the return code in the returncode attribute.
zh_cn: CalledProcessError 对象在 returncode 属性中包含返回代码。

source: The TimeoutExpired exception will be re-raised after the child process has terminated.
zh_cn: 在子进程终止之后，TimeoutExpired 异常将被重新引发。

source: The close method returns None if the subprocess exited successfully, or the subprocess’s return code if there was an error.
zh_cn: 如果子进程成功退出，则 close 方法返回 None ，否则如果有错误则返回子进程的返回码。

source: The executable argument specifies a replacement program to execute.
zh_cn: executable 参数指定要执行的替换程序。

source: The input argument is passed to Popen.communicate() and thus to the subprocess’s stdin.
zh_cn: input 参数传递给 Popen.communicate()，从而传递给子进程的标准输入。

source: The preexec_fn parameter is not safe to use in the presence of threads in your application.
zh_cn: preexec_fn 参数在应用程序中存在线程时不安全。

source: The shell argument (which defaults to False) specifies whether to use the shell as the program to execute.
zh_cn: shell 参数(默认为 False)指定是否使用 shell 作为要执行的程序。

source: The timeout argument is passed to Popen.communicate().
zh_cn: timeout 参数传递给 Popen.communicate()。

source: The start_new_session parameter can take the place of a previously common use of preexec_fn to call os.setsid() in the child.
zh_cn: start_new_session 参数可以代替以前常用的 preexec_fn 来调用子级中的 os.setsid()。

source: The buffering argument has the same meaning as the corresponding argument to the built-in open() function.
zh_cn: buffering 参数的含义与内置的 open() 函数的参数相同。

source: The actual encoding of the output data may depend on the command being invoked, so the decoding to text will often need to be handled at the application level.
zh_cn: 输出数据的实际编码可能取决于被调用的命令，因此解码到文本通常需要在应用程序级别进行处理。

source: The arguments shown above are merely the most common ones, described below in Frequently Used Arguments (hence the use of keyword-only notation in the abbreviated signature).
zh_cn: 上面显示的参数仅仅是最常用的参数，在 Frequently Used Arguments 中进行了介绍(因此在缩写签名中使用了关键字符号)。

source: The arguments shown above are merely the most common ones.
zh_cn: 上面显示的参数仅仅是最常见的参数。

source: The arguments to Popen are as follows.
zh_cn: Popen 的参数如下。

source: The child process could deadlock before exec is called.
zh_cn: 在调用 exec 之前，子进程可能会死锁。

source: The child process will block if it generates enough output to a pipe to fill up the OS pipe buffer as the pipes are not being read from.
zh_cn: 子进程会阻塞，如果因管道未被读取而产生足够的输出到管道，导致充满 OS 管道缓冲区。

source: The default varies by platform: Always true on POSIX.
zh_cn: 默认值因平台而异：在 POSIX 上始终为 true。

source: The full function signature is largely the same as that of run() - most arguments are passed directly through to that interface.
zh_cn: 完整的函数签名与 run() 大致相同 - 大多数参数直接传递到该接口。

source: The full function signature is largely the same as that of the Popen constructor - this function passes all supplied arguments other than timeout directly through to that interface.
zh_cn: 全功能签名与 Popen 构造函数的基本相同 - 该函数传递除 timeout 外所有提供的参数到那个接口。

source: The full function signature is largely the same as that of the Popen constructor - apart from timeout, input and check, all the arguments to this function are passed through to that interface.
zh_cn: 完整的函数签名与 Popen 构造函数基本相同，除了 timeout, input 和 check, 该函数的所有参数传递给那个接口。

source: The only time you need to specify shell=True on Windows is when the command you wish to execute is built into the shell (e.g. dir or copy).
zh_cn: 在 Windows 上需要指定 shell=True 的唯一时间是您希望执行的命令内置于 shell 中(例如 dir 或 copy)。

source: The recommended approach to invoking subprocesses is to use the run() function for all use cases it can handle.
zh_cn: 推荐的调用子进程的方法是对它可以处理的所有用例使用 run() 函数。

source: The return value is an open file object connected to the pipe, which can be read or written depending on whether mode is 'r' (default) or 'w'.
zh_cn: 返回值是一个连接到管道的打开的文件对象，其可以读或写，取决于 mode 为 'r'(默认值)或 'w'。

source: The returned file object reads or writes text strings rather than bytes.
zh_cn: 返回的文件对象读取或写入文本字符串而不是字节。

source: The shell is given by the Windows environment variable COMSPEC: it is usually cmd.exe, which returns the exit status of the command run; on systems using a non-native shell, consult your shell documentation.
zh_cn: 该 shell 由 Windows 环境变量 COMSPEC 给出：它通常是 cmd.exe，它返回命令运行;在使用非本地 shell 的系统上，请查阅您的 shell 文档。

source: The underlying process creation and management in this module is handled by the Popen class.
zh_cn: 该模块中的底层进程的创建和管理由 Popen 类处理。

source: The “l” and “v” variants of the spawn* functions differ in how command-line arguments are passed.
zh_cn: 函数参数的传递方式不同， spawn* 函数的“l”和“v”变体不同。

source: The “l” variants are perhaps the easiest to work with if the number of parameters is fixed when the code is written; the individual parameters simply become additional parameters to the spawnl*() functions.
zh_cn: 如果在编写代码时参数的数量是固定的，则“l”变体可能是最容易使用的变体;各个参数只是成为 spawnl*() 函数的附加参数。

source: The “v” variants are good when the number of parameters is variable, with the arguments being passed in a list or tuple as the args parameter.
zh_cn: 当参数的数量是可变的时，“v”变体是好的，参数以 args 参数的形式在列表或元组中传递。

source: This behaviour may be overridden by setting universal_newlines to True as described above in Frequently Used Arguments.
zh_cn: 该行为可以通过设置 universal_newlines 为 True 来重写，如 Frequently Used Arguments 中所述。

source: This does not capture stdout or stderr by default.
zh_cn: 默认情况下这不会捕获 stdout 或 stderr。

source: This includes, for example, quoting or backslash escaping filenames with spaces in them.
zh_cn: 这包括，例如，在其中包含空格的引号或反斜线转义文件名。

source: This is because the underlying CreateProcess() operates on strings.
zh_cn: 这是因为底层的 CreateProcess() 对字符串进行操作。

source: This is equivalent to:
zh_cn: 这相当于：

source: This is implemented by calling the Standard C function system(), and has the same limitations.
zh_cn: 这是通过调用标准 C 函数 system() 来实现的，并且具有相同的限制。

source: This is implemented using subprocess.Popen; see that class’s documentation for more powerful ways to manage and communicate with subprocesses.
zh_cn: 这是通过使用 subprocess.Popen 来实现的。请参阅该类的文档以获取更多有效的方式来管理和与子流程进行通信。

source: This means that the string must be formatted exactly as it would be when typed at the shell prompt.
zh_cn: 这意味着该字符串的格式必须与在 shell 提示符下键入时的格式完全相同。

source: This was unintentional and did not match the behavior of Python 2 as most code expected.
zh_cn: 这是无意的，并不符合大多数代码预期的 Python 2 的行为。

source: To also capture standard error in the result, use stderr=subprocess.STDOUT:
zh_cn: 要在结果中捕获标准错误，请使用 stderr=subprocess.STDOUT：

source: To do so, pass PIPE for the stdout and/or stderr arguments.
zh_cn: 为此，请为 stdout 和/或 stderr 参数传递 PIPE。

source: Unless otherwise stated, it is recommended to pass args as a sequence.
zh_cn: 除非另有说明，否则建议将 args 作为序列传递。

source: Valid values are PIPE, DEVNULL, an existing file descriptor (a positive integer), an existing file object, and None.
zh_cn: 有效值为 PIPE，DEVNULL 现有文件描述符(正整数)，现有的 file object 和 None。

source: Wait for command to complete, then return a CompletedProcess instance.
zh_cn: 等待命令完成，然后返回一个 CompletedProcess 实例。
